xml/PTZBinding.ModifyPresetTour.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <tptz:ModifyPresetTour>
    <tptz:ProfileToken></tptz:ProfileToken>
    <tptz:PresetTour token="">
     <tt:Name></tt:Name>
     <tt:Status>
      <tt:State>Idle</tt:State>
      <tt:CurrentTourSpot>
       <tt:PresetDetail>
        <tt:PresetToken></tt:PresetToken>
        <!-- extensibility element(s) -->
       </tt:PresetDetail>
       <tt:Speed>
        <tt:PanTilt x="0.0" y="0.0" space="http://www.example.com/schema/anyURI">
        </tt:PanTilt>
        <tt:Zoom x="0.0" space="http://www.example.com/schema/anyURI">
        </tt:Zoom>
       </tt:Speed>
       <tt:StayTime>PT0S</tt:StayTime>
       <tt:Extension>
        <!-- extensibility element(s) -->
       </tt:Extension>
      </tt:CurrentTourSpot>
      <tt:Extension>
       <!-- extensibility element(s) -->
      </tt:Extension>
     </tt:Status>
     <tt:AutoStart>false</tt:AutoStart>
     <tt:StartingCondition RandomPresetOrder="false">
      <tt:RecurringTime>0</tt:RecurringTime>
      <tt:RecurringDuration>PT0S</tt:RecurringDuration>
      <tt:Direction>Forward</tt:Direction>
      <tt:Extension>
       <!-- extensibility element(s) -->
      </tt:Extension>
     </tt:StartingCondition>
     <tt:TourSpot>
      <tt:PresetDetail>
       <tt:PresetToken></tt:PresetToken>
       <!-- extensibility element(s) -->
      </tt:PresetDetail>
      <tt:Speed>
       <tt:PanTilt x="0.0" y="0.0" space="http://www.example.com/schema/anyURI">
       </tt:PanTilt>
       <tt:Zoom x="0.0" space="http://www.example.com/schema/anyURI">
       </tt:Zoom>
      </tt:Speed>
      <tt:StayTime>PT0S</tt:StayTime>
      <tt:Extension>
       <!-- extensibility element(s) -->
      </tt:Extension>
     </tt:TourSpot>
     <tt:Extension>
      <!-- extensibility element(s) -->
     </tt:Extension>
    </tptz:PresetTour>
   </tptz:ModifyPresetTour>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
